examples/profile.dbml.dot
digraph dbml {
      rankdir=LR;
      graph [fontname="helvetica", fontsize=32, fontcolor="#29235c", bgcolor="transparent"];
      node [penwidth=0, margin=0, fontname="helvetica", fontsize=32, fontcolor="#29235c"];
      edge [fontname="helvetica", fontsize=32, fontcolor="#29235c", color="#29235c"];

      "job_category" [id=job_category;label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#29235c"><font color="#ffffff"><B>       job_category       </B></font></TD></TR>
    <TR><TD PORT="f0" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    full_time    </i></font></TD></TR>
<TR><TD PORT="f1" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    part_time    </i></font></TD></TR>
<TR><TD PORT="f2" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    intern    </i></font></TD></TR>
<TR><TD PORT="f3" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    on_campus    </i></font></TD></TR>
    </TABLE>>];
"apply_status" [id=apply_status;label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#29235c"><font color="#ffffff"><B>       apply_status       </B></font></TD></TR>
    <TR><TD PORT="f0" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    pending    </i></font></TD></TR>
<TR><TD PORT="f1" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    reviewed    </i></font></TD></TR>
<TR><TD PORT="f2" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    declined    </i></font></TD></TR>
    </TABLE>>];
"eligibility_status" [id=eligibility_status;label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#29235c"><font color="#ffffff"><B>       eligibility_status       </B></font></TD></TR>
    <TR><TD PORT="f0" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    all    </i></font></TD></TR>
<TR><TD PORT="f1" BGCOLOR="#e7e2dd"><font color="#1d71b8"><i>    special_major    </i></font></TD></TR>
    </TABLE>>];
      
      
      "user" [id="user";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       user       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">username<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">email<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">password_digest<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">role<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">created_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">updated_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"profile" [id="profile";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       profile       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">user_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">created_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"basic_profile" [id="basic_profile";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       basic_profile       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">profile_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">avatar<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>blob</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">birth<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>date</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">city<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">state<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f8" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">country<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f9" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">skillset<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f10" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">career_objective<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>text</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"education_profile" [id="education_profile";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       education_profile       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">profile_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">college_name<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">location<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">degree<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">major<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">year_of_passing<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>date</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"experience_profile" [id="experience_profile";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       experience_profile       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">profile_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">company_name<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">title<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">location<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">start_date<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>date</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">end_date<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>date</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f8" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">work_description<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>text</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"company" [id="company";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       company       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">company_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">avatar<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>blob</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">location<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">description<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">contract_email<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f8" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">contract_phone<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"job" [id="job";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       job       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">company_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">title<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">created_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">application_deadline<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">location<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">salary<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>float</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f8" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">desc<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>text</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f9" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">category<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>job_category</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"job_application" [id="job_application";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       job_application       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">job_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">applicant_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">resume<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">status<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>apply_status</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">created_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">updated_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"event" [id="event";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       event       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">company_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">name<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">description<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f5" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">time<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>date</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f6" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">location<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f7" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">eligibility<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>eligibility_status</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f8" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">created_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f9" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">updated_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"event_regisiteration" [id="event_regisiteration";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10" >
      <TR><TD PORT="f0" WIDTH="150" BGCOLOR="#1d71b8"><font color="#ffffff"><B>       event_regisiteration       </B></font></TD></TR>
<TR><TD ALIGN="left" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><b>id</b><FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>integer</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">event_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">applicant_id<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>varchar(32)</i> <b>(!)</b></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="left" PORT="f4" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">regisitered_at<FONT>    </FONT></TD>
          <TD ALIGN="RIGHT"><font><i>timestamp</i></font></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
    
      profile:f0 -> user:f0 [style=invis, weight=100, color=red]
    profile:f2:e -> user:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="1", arrowhead="normal", arrowtail="none"]
basic_profile:f0 -> profile:f0 [style=invis, weight=100, color=red]
    basic_profile:f2:e -> profile:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="1", arrowhead="normal", arrowtail="none"]
education_profile:f0 -> profile:f0 [style=invis, weight=100, color=red]
    education_profile:f2:e -> profile:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
experience_profile:f0 -> profile:f0 [style=invis, weight=100, color=red]
    experience_profile:f2:e -> profile:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
company:f0 -> user:f0 [style=invis, weight=100, color=red]
    company:f2:e -> user:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="1", arrowhead="normal", arrowtail="none"]
job:f0 -> company:f0 [style=invis, weight=100, color=red]
    job:f2:e -> company:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
job_application:f0 -> job:f0 [style=invis, weight=100, color=red]
    job_application:f2:e -> job:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
job_application:f0 -> profile:f0 [style=invis, weight=100, color=red]
    job_application:f3:e -> profile:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
event:f0 -> company:f0 [style=invis, weight=100, color=red]
    event:f2:e -> company:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
event_regisiteration:f0 -> event:f0 [style=invis, weight=100, color=red]
    event_regisiteration:f2:e -> event:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
event_regisiteration:f0 -> profile:f0 [style=invis, weight=100, color=red]
    event_regisiteration:f3:e -> profile:f1:w [penwidth=3, color="#29235c", headlabel="1", taillabel="*", arrowhead="normal", arrowtail="none"]
      job:f9:e -> job_category:f0:w [penwidth=3, color="#29235c", arrowhead="none", arrowtail="none"]
job_application:f5:e -> apply_status:f0:w [penwidth=3, color="#29235c", arrowhead="none", arrowtail="none"]
event:f7:e -> eligibility_status:f0:w [penwidth=3, color="#29235c", arrowhead="none", arrowtail="none"]
    }
